docs/checkin-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://webservices.micros.com/og/4.3/ResvAdvanced/"
                   xmlns:ns2="http://webservices.micros.com/og/4.3/Common/"
                   xmlns:ns3="http://webservices.micros.com/og/4.3/Core/">
    <SOAP-ENV:Header>
        <ns3:Action>http://webservices.micros.com/ows/5.1/ResvAdvanced.wsdl#CheckIn</ns3:Action>
        <ns3:OGHeader transactionID="040824" timeStamp="2012-06-18T17:31:48+08:00">
            <ns3:Origin entityID="OWS" organizationID="WEB" systemType="WEB"/>
            <ns3:Destination entityID="WBE" organizationID="WBE" systemType="WBE"/>
            <ns3:Authentication>
                <ns3:UserCredentials>
                    <ns3:UserName>ADMINUSER2</ns3:UserName>
                    <ns3:UserPassword>OPERA1234</ns3:UserPassword>
                    <ns3:Domain>001</ns3:Domain>
                </ns3:UserCredentials>
            </ns3:Authentication>
        </ns3:OGHeader>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:CheckInRequest Keys="2" KeyEncoder="" GetKeyTrack="true" PrintRegistration="false" ApprovalCode=""
                            KeyExpirationDate="" MobilePhoneAudioKey="false" MobilePhoneNumber=""
                            MobileKeyReferenceId="" KioskCall="false" EmailStaff="false">
            <ns1:ReservationRequest/>
            <ns1:CreditCardInfo>
                <ns1:CreditCard>
                    <ns2:cardCode>VI</ns2:cardCode>
                    <ns2:cardHolderName>Joe Shmoe</ns2:cardHolderName>
                    <ns2:cardNumber>41111111111111111</ns2:cardNumber>
                    <ns2:effectiveDate>2001-01-01</ns2:effectiveDate>
                    <ns2:expirationDate>2012-08-31</ns2:expirationDate>
                    <ns2:EncryptedSwipe>
                        <ns2:TrackIndicator>2</ns2:TrackIndicator>
                        <ns2:SwiperType>01</ns2:SwiperType>
                        <ns2:SwiperID>SSWW</ns2:SwiperID>
                        <ns2:MaskedPAN>41111111111111111</ns2:MaskedPAN>
                        <ns2:Track1>
                            C8715C0A0CBC88C47A3FBADFDE1D9FED81425961F5BFF8D7369955F4AFF4D03CE1E6EFF53F1B7B0FDBFCFF25A7EA8EB2DAF1C2282542E9C8EF5C0364E34EF9DC
                        </ns2:Track1>
                        <ns2:Track2>10F0C303A3C0879856C02D8D1E53200D51CFAF2F1A9B3FF0B1E305B879B97674DE274D7D4B216C25
                        </ns2:Track2>
                        <ns2:KeySerialNumber>9012080B02AC5B00004E</ns2:KeySerialNumber>
                    </ns2:EncryptedSwipe>
                </ns1:CreditCard>
            </ns1:CreditCardInfo>
            <ns1:Transactions/>
        </ns1:CheckInRequest>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>